In [1]:
import numpy as np
import pandas as pd

# Pandas series 
Basic arguments are data and labels.

In [2]:
labels = ['a', 'b', 'c', 'd']
data = [1, 2, 3, 4]
arr = np.array(data)
dic = {'a':1, 'b':2, 'c':3, 'd':4}

python list can be passed as a data, and another list as a label

In [3]:
pd.Series(data=data, index=labels)

a    1
b    2
c    3
d    4
dtype: int64

Numpy array can be passed as a data

In [4]:
pd.Series(data=arr, index=labels)

a    1
b    2
c    3
d    4
dtype: int32

Also just python dictionary can be passed as labeled data

In [5]:
pd.Series(dic)

a    1
b    2
c    3
d    4
dtype: int64

## Choosing elements of series by label

In [6]:
ser1 = pd.Series([[256,0,0],[0,256,0],[0,0,256]],['red','green','blue'])
ser1

red      [256, 0, 0]
green    [0, 256, 0]
blue     [0, 0, 256]
dtype: object

To get data that is described by specific label, just put the label in brackets

In [7]:
ser1['red']

[256, 0, 0]

To choose more than one elements put list of labels in sq brackets

In [8]:
ser1[['red','green']]

red      [256, 0, 0]
green    [0, 256, 0]
dtype: object

## Choosing elements of series by index

To choose elements by index, use iloc method

In [9]:
ser1.iloc[0]

[256, 0, 0]

In [10]:
ser1.iloc[[0,1]]

red      [256, 0, 0]
green    [0, 256, 0]
dtype: object

# Data Frames

Data frames are built with pandas series, it supports number of columns which can be labeled

In [11]:
np.random.seed(101)

In [12]:
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Choosing columns from data frame

To chose single column, put its name into a sq brackets

In [13]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

To choose multiple columns puts a list with names in brackets

In [14]:
df[['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

## Creating a new column in data frame

To create new column put its name in sq brackets and assign list of values for that column.

It can be also done by choosing an existing columns and for example adding them

In [15]:
df['new1'] = [1,2,3,4,5]
df['new2'] = df['Y'] + df['Z']

In [16]:
df

          W         X         Y         Z  new1      new2
A  2.706850  0.628133  0.907969  0.503826     1  1.411795
B  0.651118 -0.319318 -0.848077  0.605965     2 -0.242112
C -2.018168  0.740122  0.528813 -0.589001     3 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057     4  0.021819
E  0.190794  1.978757  2.605967  0.683509     5  3.289476

## Removing columns or rows

To remove row or column use ***drop*** method and pass its name in brackets. it is needed to specify what ***axis*** should be removed, 0 is default which means that row will be deleted, for column type axis=1

data frame without removed entity is not overwrited by default, you need assign it to new variable

In [17]:
df2 = df.drop('D')
df2 = df.drop('new2',axis=1)

In [18]:
df2

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     2
C -2.018168  0.740122  0.528813 -0.589001     3
D  0.188695 -0.758872 -0.933237  0.955057     4
E  0.190794  1.978757  2.605967  0.683509     5

In [19]:
df

          W         X         Y         Z  new1      new2
A  2.706850  0.628133  0.907969  0.503826     1  1.411795
B  0.651118 -0.319318 -0.848077  0.605965     2 -0.242112
C -2.018168  0.740122  0.528813 -0.589001     3 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057     4  0.021819
E  0.190794  1.978757  2.605967  0.683509     5  3.289476

If you want to overwrite data frame without removed series, type parameter ***inplace=True***

In [20]:
df.drop('new1', axis=1, inplace=True)

In [21]:
df

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

## Choosing rows from data frame

### Choosing rows by label

To choose row by label, use ***loc*** method and pass row label in sq brackets

In [22]:
df.loc['A']

W       2.706850
X       0.628133
Y       0.907969
Z       0.503826
new2    1.411795
Name: A, dtype: float64

To choose multiple rows pass a list of labels in sq brackets

In [23]:
df.loc[['C','D']]

          W         X         Y         Z      new2
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819

### Choosing rows by index

To choose row by index use ***iloc*** method and pass row index in sq brackets

In [24]:
df.iloc[0]

W       2.706850
X       0.628133
Y       0.907969
Z       0.503826
new2    1.411795
Name: A, dtype: float64

To choose multiple rows pass a list as above

In [25]:
df.iloc[[2,3]]

          W         X         Y         Z      new2
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819

## Choosing subset of dataframe

### Choosing subset by label

To choose subset - for one specific cell use ***loc*** method, then put row label and column label in sq brackets

In [26]:
df.loc['B','Y']

-0.8480769834036315

For multiple cells put choosen row labels and column labels as a list

In [27]:
df.loc[['B','D'],['W','Y']]

          W         Y
B  0.651118 -0.848077
D  0.188695 -0.933237

### Choosing subset by index

To choose subset by index use ***iloc*** method instead of loc, and put indexes in sq brackets

In [28]:
df.iloc[[1,3],[0,2]]

          W         Y
B  0.651118 -0.848077
D  0.188695 -0.933237

## Conditional selection

### Conditions on whole data frame

To check some conditios on data frame, for example which of values are greater than zero just type a condition. It will return data frame of booleans

In [29]:
df > 0

       W      X      Y      Z   new2
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True   True
E   True   True   True   True   True

To get back data farame with values that satisfy condition, put condition in sq brackets after data frame

In [30]:
df[df>0]

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

### Get rows by column condition

To get only rows in which a condition is satisfied for specific column, type that column and its condition on sq brackets on data frame

In [31]:
df[df['X']>0]

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  1.411795
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
E  0.190794  1.978757  2.605967  0.683509  3.289476

It returns only columns A, C, E, because for B and D value in column 'X' was lesser than 0

### Get rows/columns from data frame after condition selecting

To get an column from processed dataframe you can do it in two steps by assigning it to new variable and choose column in sq brackets:

In [32]:
new_df = df[df['X']>0]
new_df['Z']

A    0.503826
C   -0.589001
E    0.683509
Name: Z, dtype: float64

Or in one step puting sq brackets with selected column after conditional expression:

In [33]:
df[df['X']>0]['Z']

A    0.503826
C   -0.589001
E    0.683509
Name: Z, dtype: float64

Row selection works the same, just use ***loc*** or ***iloc*** method

In [34]:
df[df['X']>0].loc['C']

W      -2.018168
X       0.740122
Y       0.528813
Z      -0.589001
new2   -0.060187
Name: C, dtype: float64

### Multiple conditions

To set multiple conditions put them in brackets and separate it by logical operation mark

***IMPORTANT:***

Instead of ***and*** - use ***&***

instead of ***or*** - use ***|***

In [35]:
df[(df['W']>0) & (df['Y']<1)]

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
D  0.188695 -0.758872 -0.933237  0.955057  0.021819

## Index operations

### Reset index to default

To reset index to default state, use ***reset_index*** method

In [36]:
df.reset_index(inplace=True)
df

  index         W         X         Y         Z      new2
0     A  2.706850  0.628133  0.907969  0.503826  1.411795
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
2     C -2.018168  0.740122  0.528813 -0.589001 -0.060187
3     D  0.188695 -0.758872 -0.933237  0.955057  0.021819
4     E  0.190794  1.978757  2.605967  0.683509  3.289476

After that the old index column will appear as a new column, and actual indexes will be reseted to default. *Remember to use __inplace=True__ if you want owerwrite changes*

### Set new index column

To set new index column, first you must add new column to dataset with demanded index

In [37]:
new_index = 'FIRST SECOND THIRD FOURTH FIFTH'.split()

In [38]:
df['new_index'] = new_index

Then use ***set_index*** method to set that column to index column

In [39]:
df.set_index('new_index', inplace=True)

In [40]:
df

          index         W         X         Y         Z      new2
new_index
FIRST         A  2.706850  0.628133  0.907969  0.503826  1.411795
SECOND        B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
THIRD         C -2.018168  0.740122  0.528813 -0.589001 -0.060187
FOURTH        D  0.188695 -0.758872 -0.933237  0.955057  0.021819
FIFTH         E  0.190794  1.978757  2.605967  0.683509  3.289476

## Multi index level

In [41]:
ind1 = ['Object1', 'Object1', 'Object1', 'Object2', 'Object2', 'Object2']
ind2 = ['1','2','3','1','2','3']
multi_ind = list(zip(ind1, ind2))
multi_ind = pd.MultiIndex.from_tuples(multi_ind)

In [42]:
df = pd.DataFrame(np.random.randn(6,2),multi_ind,['A','B'])
df

                  A         B
Object1 1  0.302665  1.693723
        2 -1.706086 -1.159119
        3 -0.134841  0.390528
Object2 1  0.166905  0.184502
        2  0.807706  0.072960
        3  0.638787  0.329646

### Naming of indexes

To add names of index columns use ***index.names*** and assign list of names

In [46]:
df.index.names = ['Element','Feature']

In [48]:
df

                        A         B
Element Feature
Object1 1        0.302665  1.693723
        2       -1.706086 -1.159119
        3       -0.134841  0.390528
Object2 1        0.166905  0.184502
        2        0.807706  0.072960
        3        0.638787  0.329646

### Accesing multi-indexed values

To access in exmple **Object2** then inside access **2** row, use two times ***loc*** or ***iloc*** method

In [53]:
df.loc['Object2'].loc['2']

A    0.807706
B    0.072960
Name: 2, dtype: float64

Then to acces one specific value pass column name after expression

In [54]:
df.loc['Object2'].loc['2']['B']

0.07295967531703869

### Cross-section (accesing all specific sub-index in data frame)

To get all occurrences of sub-index use ***xs*** mthod and pas as an arguments value of index, and level of index

In [56]:
df.xs('1',level='Feature')

                A         B
Element
Object1  0.302665  1.693723
Object2  0.166905  0.184502

## Dropping NaN values

In [70]:
data = {'A':[0,1,2,3],'B':[4,5,6,np.nan],'C':[7,8,np.nan,np.nan],'D':[9,np.nan,np.nan,np.nan]}
df = pd.DataFrame(data)
df

   A    B    C    D
0  0  4.0  7.0  9.0
1  1  5.0  8.0  NaN
2  2  6.0  NaN  NaN
3  3  NaN  NaN  NaN

To drop each row with NaN values use ***dropna*** method

In [71]:
df.dropna()

   A    B    C    D
0  0  4.0  7.0  9.0

To drop all columns set ***axis=1*** (default is 0 - rows)

In [72]:
df.dropna(axis=1)

   A
0  0
1  1
2  2
3  3

To specify at least how many proper values must exist for row to not be droped, use ***thresh*** attribute

In [77]:
df.dropna(thresh=3)

   A    B    C    D
0  0  4.0  7.0  9.0
1  1  5.0  8.0  NaN

## Filling NaN values

To fill NaN values with other values, use ***fillna*** method, and pass a value within it

In [79]:
df.fillna(value='FILLED')

   A       B       C       D
0  0     4.0     7.0     9.0
1  1     5.0     8.0  FILLED
2  2     6.0  FILLED  FILLED
3  3  FILLED  FILLED  FILLED

to fill Nan for specific column with i.e. mean of that column values, just pass expression as value

In [82]:
df['B'].fillna(value=df['B'].mean())

0    4.0
1    5.0
2    6.0
3    5.0
Name: B, dtype: float64

## Groupby and aggregation functions